src/fixtures/gm/gm_example.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:siri="http://wsdl.siri.org.uk" xmlns:siri1="http://www.siri.org.uk/siri" xmlns:acsb="http://www.ifopt.org.uk/acsb" xmlns:ifop="http://www.ifopt.org.uk/ifopt">
   <soapenv:Header/>
   <soapenv:Body>
      <siri:GeneralMessage>
         <ServiceDeliveryInfo>
            <siri1:ResponseTimestamp>2022-01-17T09:30:46+02:00</siri1:ResponseTimestamp>
            <siri1:ProducerRef>CBOX</siri1:ProducerRef>
         </ServiceDeliveryInfo>
         <Notification>
                <siri1:GeneralMessageDelivery version="2.0">
                <ResponseTimestamp>2001-12-17T09:30:47.0Z</ResponseTimestamp>
                <RequestMessageRef>12345</RequestMessageRef>
                <Status>true</Status>
                <GeneralMessage formatRef="string">
                    <RecordedAtTime>2001-12-17T09:30:47.0Z</RecordedAtTime>
                    <InfoMessageIdentifier>00034567</InfoMessageIdentifier>
                    <InfoMessageVersion>2</InfoMessageVersion>
                    <InfoChannelRef>WARNINGS</InfoChannelRef>
                    <ValidUntilTime>2001-12-17T09:30:47.0Z</ValidUntilTime>
                    <Content>Beware the Ides of March</Content>
                </GeneralMessage>
                <GeneralMessageCancellation>
                    <RecordedAtTime>2001-12-17T09:30:47.0Z</RecordedAtTime>
                    <InfoMessageIdentifier>00034564</InfoMessageIdentifier>
                    <InfoChannelRef>WARNINGS</InfoChannelRef>
                </GeneralMessageCancellation>
            </siri1:GeneralMessageDelivery>
         </Notification>
      </siri:GeneralMessage>
   </soapenv:Body>
</soapenv:Envelope>
